/**
 *[문제01] 단일 연결리스트 노드를 생성하는 생성자 함수를 만들어 보자.
 */

/**
 * [문제02] 단일 연결리스트를 생성하는 생성자 함수를 만들어 보자.
 */

/**
 * [문제03] 단일 연결리스트가 비어있는지 확인 하는 메소드를 작성해 보자. (메소드이름: isEmpty)
 */

/**
 * [문제00] 단일 연결리스트의 노드들을 배열로 반환하는 메소드를 작성해보자.(toArray)
 */

/**
 * [문제04] 단일 연결리스트에 데이터를 삽입하는 메소드를 작성해 보자. (메소드 이름:insert)
 * 헤드일때 헤드가 아닐때 로 나뉜다.
 */

/**
 * [문제05] 단일 연결리스트의 데이터를 삭제하는 메소드를 작성해 보자. (remove)
 * 헤드에 있을때 중간에 있을때 마지막에 있을 때로 나뉜다.
 */

/**
 * [문제06] 단일 연결리스트의 헤드 항목을 삭제하는 메소드를 작성해 보자 (deleteAtHead)
 * 헤드가 널일때 헤드가 널이 아닐때 로 나뉨
 */

/**
 * [문제07] 단일 연결리스트의 데이터를 검색하는 함수를 작성해 보자.(find) 데이터가 있으면 true, 없으면 false
 */
